app/controllers/articles_controller.rb

    def index
        @articles = Article.all.order(:created_at).reverse
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" ASC

    def create
        article = Article.create!(user_id: params["article"]["user_id"], title: params["article"]["title"], url: params["article"]["url"], description: params["article"]["desc"])
---
INSERT INTO "articles" ("user_id", "title", "url", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def show
        @article = Article.find(params["id"])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]