app/controllers/comments_controller.rb

    def index
        @comments = Comment.all.order(:created_at).reverse
---
SELECT "comments".* FROM "comments" ORDER BY "comments"."created_at" ASC

    def create
        comment = Comment.create!(user_id: params["comment"]["user_id"], article_id: params["comment"]["article_id"], content: params["comment"]["content"])
---
INSERT INTO "comments" ("user_id", "article_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["article_id", 4], ["content", "Wow I really like this!!"], ["created_at", "2020-06-10 19:21:54.202034"], ["updated_at", "2020-06-10 19:21:54.202034"]]

    def show
        comment = Comment.find(params["id"])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

    def update
        comment = Comment.find(params["id"])
        # binding.pry
        comment.content = params["comment"]["content"]
        comment.save
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "sdflkj"], ["updated_at", "2020-06-10 23:16:41.706262"], ["id", 16]]