app/controllers/sessions_controller.rb

    def create
        puts params
        user = User.find_by(email: params["user"]["email"]).try(:authenticate, params["user"]["password"])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "dwillingham13@gmail.com"], ["LIMIT", 1]]